package com.domain.lesson2;

import java.util.Scanner;

public class Loop {
    public static void main(String[] args) {
/*

        //сколько итераций - столько цикл повторяется

        /* цикл while*/

        /*while (условие) {
            тело цикла;
        break;  позволяет выйти из цикла
        continue; позволяет перейти на следующую итерацию
        }
        */
        /*
         int a = 1;
         while (a<=15){
             a+= 3;
             System.out.printf("a=%d\n", a);
         }
         // Программа загадывает число от 1 до 5 включительно [1;5]
        /* Пользователь вводит чисор
        *Программа в зависимости от ввода пользователя
        * вводит следующее:
        * 1. загаданное число меньше
        * 2. загаданное число больше
        * 3. Вы угадали
        * 0 = для выхода программы
        *
         */

/*
        int programNum = (int) (Math.random() * 5)+1)) +1;
        Scanner in = new Scanner (System.in);
        while (true){
        int scan = in.nextInt();
        if (scan==0) {
            System.out.println("Вы выходите из программы");
            break;
        else if (scan > programNum) {
            System.out.println("Вы ввели большее значение");
        } else if (scan< programNum) {
            System.out.println("Вы ввели меньшее значение");
        } else {
            System.out.println("Вы угадали");
            break;

       /* LoopName: while (condition) {
                while (condition2);
                break loopname;
        }

        //Цикл do while
            /* do {
            тело цикла
            } while (условие);
             */
/*
            do {
                System.out.println("Итерация цикла do while");
            } while (false);



            // Цикл for
          //  for (int i = 0; i< ; i++) { // fori

            int n = 5;
            int res = 1;
            for (int i = 1; i < n ; i++) {
                res *= i;
                System.out.println(res)

                        //Посчитать наибольший общий делитель  (НОД) двух чисел
            }
*/


    }
}
